Tekla Open API Reference for Tekla Structures 2025
Chamfer Properties
The Chamfer type exposes the following members.
Properties
Name | Description
DZ1
 The thickness above the offset.
Note that this does nothing when used with the PolyBeam.
DZ2
 The thickness below the offset.
Note that this does nothing when used with the PolyBeam.
Type
 The basic shape type of the chamfer.
X
 The dimension of the chamfer.
Y
 The second dimension of straight chamfers.
Top
See Also
Reference
Chamfer Class
Tekla.Structures.Model Namespace